IdeaRS.Connections
ConItemListAttribute Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConItemListAttribute"]
Inheritance Hierarchy
Object
 Attribute
 IdeaRS.Connections.Data.ConItemListAttribute
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConItemListAttribute : Attribute
The ConItemListAttribute type exposes the following members.
Constructors
Name | Description
ConItemListAttribute
Initializes a new instance of the ConItemListAttribute class
Top
Properties
Name | Description
PropertyType
TypeId
When implemented in a derived class, gets a unique identifier for this Attribute.
 (Inherited from Attribute.)
WrapperType
Top
Methods
Name | Description
Equals
Returns a value that indicates whether this instance is equal to a specified object.
 (Inherited from Attribute.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Returns the hash code for this instance.
 (Inherited from Attribute.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDefaultAttribute
When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class.
 (Inherited from Attribute.)
Match
When overridden in a derived class, returns a value that indicates whether this instance equals a specified object.
 (Inherited from Attribute.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace